stevenj/avr-libc3/include/avr/io/attiny24.h
/* CPU - CPU Registers (0x0000) */
#define CPU_BASE         _SFR_MEM8 (0x0000) /* CPU Base Address */
#define CPU_PRR          _SFR_MEM8 (0x0020) /* Power Reduction Register */
#define CPU_GPIOR0       _SFR_MEM8 (0x0033) /* General Purpose I/O Register 0 */
#define CPU_GPIOR1       _SFR_MEM8 (0x0034) /* General Purpose I/O Register 1 */
#define CPU_GPIOR2       _SFR_MEM8 (0x0035) /* General Purpose I/O Register 2 */
#define CPU_CLKPR        _SFR_MEM8 (0x0046) /* Clock Prescale Register */
#define CPU_OSCCAL       _SFR_MEM8 (0x0051) /* Oscillator Calibration Value */
#define CPU_MCUSR        _SFR_MEM8 (0x0054) /* MCU Status Register */
#define CPU_MCUCR        _SFR_MEM8 (0x0055) /* MCU Control Register */
#define CPU_SPL          _SFR_MEM8 (0x005D) /* Stack Pointer Low */
#define CPU_SREG         _SFR_MEM8 (0x005F) /* Status Register */

/* BOOT_LOAD - Bootloader (0x0000) */
#define BOOT_LOAD_BASE   _SFR_MEM8 (0x0000) /* BOOT_LOAD Base Address */
#define BOOT_LOAD_SPMCSR _SFR_MEM8 (0x0057) /* Store Program Memory Control Register */

/* FUSE - Fuses (0x0000) */
#define FUSE_BASE        _SFR_MEM8 (0x0000) /* FUSE Base Address */
#define FUSE_LOW         _SFR_MEM8 (0x0000) 
#define FUSE_HIGH        _SFR_MEM8 (0x0001) 
#define FUSE_EXTENDED    _SFR_MEM8 (0x0002) 

/* LOCKBIT - Lockbits (0x0000) */
#define LOCKBIT_BASE     _SFR_MEM8 (0x0000) /* LOCKBIT Base Address */
#define LOCKBIT_LOCKBIT  _SFR_MEM8 (0x0000) 
/* avr-libc typedef for avr/fuse.h */
typedef FUSE_t NVM_FUSES_t;

/*
================================================================================
Interrupt Vector Definitions
================================================================================
*/

/* Vector 0 is the reset vector */
#define None_RESET_vect_num      (0)                 
#define None_RESET_vect          _VECTOR(0)          /* External Pin, Power-on Reset, Brown-out Reset,Watchdog Reset */
#define None_EXT_INT0_vect_num   (1)                 
#define None_EXT_INT0_vect       _VECTOR(1)          /* External Interrupt Request 0 */
#define None_PCINT0_vect_num     (2)                 
#define None_PCINT0_vect         _VECTOR(2)          /* Pin Change Interrupt Request 0 */
#define None_PCINT1_vect_num     (3)                 
#define None_PCINT1_vect         _VECTOR(3)          /* Pin Change Interrupt Request 1 */
#define None_WDT_vect_num        (4)                 
#define None_WDT_vect            _VECTOR(4)          /* Watchdog Time-out */
#define None_TIM1_CAPT_vect_num  (5)                 
#define None_TIM1_CAPT_vect      _VECTOR(5)          /* Timer/Counter1 Capture Event */
#define None_TIM1_COMPA_vect_num (6)                 
#define None_TIM1_COMPA_vect     _VECTOR(6)          /* Timer/Counter1 Compare Match A */
#define None_TIM1_COMPB_vect_num (7)                 
#define None_TIM1_COMPB_vect     _VECTOR(7)          /* Timer/Counter1 Compare Match B */
#define None_TIM1_OVF_vect_num   (8)                 
#define None_TIM1_OVF_vect       _VECTOR(8)          /* Timer/Counter1 Overflow */
#define None_TIM0_COMPA_vect_num (9)                 
#define None_TIM0_COMPA_vect     _VECTOR(9)          /* Timer/Counter0 Compare Match A */
#define None_TIM0_COMPB_vect_num (10)                
#define None_TIM0_COMPB_vect     _VECTOR(10)         /* Timer/Counter0 Compare Match B */
#define None_TIM0_OVF_vect_num   (11)                
#define None_TIM0_OVF_vect       _VECTOR(11)         /* Timer/Counter0 Overflow */
#define None_ANA_COMP_vect_num   (12)                
#define None_ANA_COMP_vect       _VECTOR(12)         /* Analog Comparator */
#define None_ADC_vect_num        (13)                
#define None_ADC_vect            _VECTOR(13)         /* ADC Conversion Complete */
#define None_EE_RDY_vect_num     (14)                
#define None_EE_RDY_vect         _VECTOR(14)         /* EEPROM Ready */
#define None_USI_STR_vect_num    (15)                
#define None_USI_STR_vect        _VECTOR(15)         /* USI START */
#define None_USI_OVF_vect_num    (16)                
#define None_USI_OVF_vect        _VECTOR(16)         /* USI Overflow */

/* Vector Table Size */
#define _VECTOR_SIZE             (2)                 /* Size of individual vector. */
#define _VECTORS_SIZE            (17 * _VECTOR_SIZE) /* Size of all vectors */
/*
================================================================================
Constants
================================================================================
*/

#define PROGMEM_START   (0x0000)                           
#define PROGMEM_SIZE    (0x0800)                           
#define PROGMEM_END     (PROGMEM_START + PROGMEM_SIZE - 1) 

#define FLASH_START     (0x0000)                           
#define FLASH_SIZE      (0x0800)                           
#define FLASH_PAGE_SIZE (0x0020)                           
#define FLASH_END       (FLASH_START + FLASH_SIZE - 1)     

#define SIGNATURESMEM_START  (0x0000)                                       
#define SIGNATURESMEM_SIZE   (0x0003)                                       
#define SIGNATURESMEM_END    (SIGNATURESMEM_START + SIGNATURESMEM_SIZE - 1) 

#define SIGNATURES_START     (0x0000)                                       
#define SIGNATURES_SIZE      (0x0003)                                       
#define SIGNATURES_PAGE_SIZE (0x0001)                                       
#define SIGNATURES_END       (SIGNATURES_START + SIGNATURES_SIZE - 1)       

#define FUSESMEM_START  (0x0000)                             
#define FUSESMEM_SIZE   (0x0003)                             
#define FUSESMEM_END    (FUSESMEM_START + FUSESMEM_SIZE - 1) 

#define FUSES_START     (0x0000)                             
#define FUSES_SIZE      (0x0003)                             
#define FUSES_PAGE_SIZE (0x0001)                             
#define FUSES_END       (FUSES_START + FUSES_SIZE - 1)       

#define LOCKBITSMEM_START  (0x0000)                                   
#define LOCKBITSMEM_SIZE   (0x0001)                                   
#define LOCKBITSMEM_END    (LOCKBITSMEM_START + LOCKBITSMEM_SIZE - 1) 

#define LOCKBITS_START     (0x0000)                                   
#define LOCKBITS_SIZE      (0x0001)                                   
#define LOCKBITS_PAGE_SIZE (0x0001)                                   
#define LOCKBITS_END       (LOCKBITS_START + LOCKBITS_SIZE - 1)       

